{
  "category": "site-specific",
  "description": "Having been raised in the coal regions of the northeastern U.S., my exposure to varied religions and cultures was limited to attending Greek Orthodox Church services on rare occasions and eating Italian food in Polish-owned restaurants. In 2005, my family moved to a suburb of Rochester, NY that offered the most for our children’s education – a nationally ranked school district started by a largely Jewish community. It is now a somewhat diversified neighborhood although our immediate neighbors – all elderly Jewish – are all pleasant reminders of its early development. Sylvia Weinthal sold us the house after building it and raising her family in it for forty-five years. Making the house our own meant taking it from its past. Within a day of possession we began to strip away its history – the record of a family and its routine intersections with objects and spaces. This has meant replacing elements of the home that were sanctified by the Weinthals’ constant presence and day-to-day tendencies with our own. I have never been entirely comfortable with that. We’ve kept the mezuzah at our front door.  This multi-part installation focused on my domestic residence – what it had, what it has lost, what I want it to have, and how those relate to a collective understanding of domestic environments and cultural displacement, permanence, integration, and ignorance. Finding Maywood resituated portions of the wallpaper and carpeting original to the building in which we live. The very first house we looked at purchasing before buying our current residence set a standard we maintained; it was on Maywood Circle.",
  "title": "Finding Maywood",
  "images": [
    "/images/findingmaywood-215x215.jpg",
    "/images/findingmaywood24-215x215.jpg",
    "/images/findingmaywood19-215x215.jpg",
    "/images/findingmaywood17-215x215.jpg",
    "/images/findingmaywood15-215x215.jpg",
    "/images/findingmaywood12-215x215.jpg",
    "/images/findingmaywood011-215x215.jpg",
    "/images/findingmaywood07-215x215.jpg",
    "/images/findingmaywood04-215x215.jpg",
    "/images/findingmaywood03-215x215.jpg",
    "/images/findingmaywood02-215x215.jpg"
  ],
  "year": "2010",
  "thumbnail": "/images/findingmaywood-215x215.jpg"
}
