{
  "category": "site-specific",
  "title": "(re)collecting/(re)constructing",
  "images": [
    "/images/dscn6356-215x215.jpg",
    "/images/recolicon-215x215.jpg",
    "/images/primary-215x215.jpg",
    "/images/dscn6368-215x215.jpg",
    "/images/dscn6367-215x215.jpg",
    "/images/dscn6365-215x215.jpg",
    "/images/dscn6363-215x215.jpg",
    "/images/dscn6362-215x215.jpg",
    "/images/dscn6361-215x215.jpg",
    "/images/dscn6358-215x215.jpg",
    "/images/dscn6357-215x215.jpg",
    "/images/dscn6355-215x215.jpg",
    "/images/dscn6352-215x215.jpg",
    "/images/chair-215x215.jpg",
    "/images/3-215x215.jpg",
    "/images/2-215x215.jpg",
    "/images/01-215x215.jpg",
    "/images/03-215x215.jpg",
    "/images/011-215x215.jpg",
    "/images/04-215x215.jpg",
    "/images/02-215x215.jpg"
  ],
  "description": "The single childhood memory of my grandfather, the one vestige of a brief seemingly inconsequential experience, it turns out, was actually a recollection I had constructed from a photograph. (re)collecting / (re)constructing addresses the means by which we fabricate memory and the futile pursuit of that which can not be regained. We possess a tendency to retrieve and retain experience; but the very means by which we attempt to do so encumbers our success. Loss [death] is the immutable genuine nature of the photographic image (Barthes) — for me this work is about the loss of loss — the dispossession of the last vestige of that which had encompassed my relationship with a portion of my past. Each photographic image represents an attempt at the recollection of one aspect of an imagined memory; each one is close to accurate/ each one is far from accurate. The partially assembled chair made from parts of various chairs emphasizes memory construction as an ongoing suppositious act. The space between scrims becomes an arena of for the fabrication of a distinct memory – the place where a coalescence of fluid components is fruitlessly undertaken again and again. The first iteration of (re)collecting/(re)constructing was installed in the Carriage House at the Islip Art Museum in 2001.",
  "year": "2001",
  "videoLinks": [
    "https://youtu.be/VQjvtk3w6Os"
  ],
  "thumbnail": "/images/dscn6356-215x215.jpg"
}
